#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aws_deepdive/kubernetes-ops-staging-10-vpc/runs/run-wuf1nvUCMRiAVvLr

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06af9c62eaa9f22de]
module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-0a7cc4a676c9d2d95]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0217d13229851e404]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-068a338d22ef82e82]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c4d4c1ad85642c48]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:091086670112:internet-gateway/igw-0c4d4c1ad85642c48" -> null
      - id       = "igw-0c4d4c1ad85642c48" -> null
        tags     = {
            "Name"                 = "staging"
            "ops_env"              = "staging"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:091086670112:vpc/vpc-06af9c62eaa9f22de" -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-073fc56993c53b35e" -> null
      - default_route_table_id               = "rtb-0d6579b163f1fb357" -> null
      - default_security_group_id            = "sg-0a3c03600495e95f4" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - id                                   = "vpc-06af9c62eaa9f22de" -> null
      - instance_tenancy                     = "default" -> null
      - main_route_table_id                  = "rtb-0d6579b163f1fb357" -> null
      - owner_id                             = "091086670112" -> null
        tags                                 = {
            "Name"                 = "staging"
            "ops_env"              = "staging"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] has been deleted
  - resource "aws_vpc_ipv4_cidr_block_association" "this" {
        id         = "vpc-cidr-assoc-0a7cc4a676c9d2d95"
      - vpc_id     = "vpc-06af9c62eaa9f22de" -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"                 = "staging-default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all               = {
          + "Name"                 = "staging-default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"                 = "staging-default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all               = {
          + "Name"                 = "staging-default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "100.64.0.0/10",
                ]
              + description      = "rfc6598: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/12",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "100.64.0.0/10",
                ]
              + description      = "rfc6598: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/12",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = "rfc1918: Private Address Space"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                 = "default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all               = {
          + "Name"                 = "default"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all             = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for staging"
      + id          = (known after apply)
      + name        = "staging"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all    = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                           = {
          + "Name"                 = "staging-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                           = {
          + "Name"                 = "staging-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                           = {
          + "Name"                 = "staging-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1a"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1c"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-private-us-east-1d"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all         = {
          + "Name"                 = "staging-public"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "100.64.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-elasticache-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1a"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1c"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                            = "staging-private-us-east-1d"
          + "kubernetes.io/cluster/staging"   = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "staging"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1a"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1c"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                                       = {
          + "Name"                          = "staging-public-us-east-1d"
          + "kubernetes.io/cluster/staging" = "shared"
          + "kubernetes.io/role/elb"        = "1"
          + "ops_env"                       = "staging"
          + "ops_managed_by"                = "terraform"
          + "ops_owners"                    = "devops"
          + "ops_source_repo"               = "kubernetes-ops"
          + "ops_source_repo_path"          = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all                             = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "100.64.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + tags_all        = {
          + "Name"                 = "staging"
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/10-vpc"
        }
      + vpc_id          = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + k8s_subnets     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id          = (known after apply)

```


</details>

*Pusher: @anhtuanit93, Action: `pull_request`*